// database
const db = require("./app/models");
const Op = db.Sequelize.Op;

const Role = db.role;
const Order = db.order;
const Item = db.item;
const OrderItems = db.orderItems;
const OrderAddress = db.orderAddress;
const ItemsManagement = db.itemsManagement;
const User = db.user;
const News = db.news;

var bcrypt = require("bcryptjs");

exports.initialDBFill = function () {
    // create roles
    Role.create({
        id: 1,
        name: "user"
    });
    Role.create({
        id: 2,
        name: "seller"
    });
    Role.create({
        id: 3,
        name: "moderator"
    });
    Role.create({
        id: 4,
        name: "admin"
    });
    // create some users
    User.create({
        name: "Владислав",
        email: 'shniperson62@gmail.com',
        password: bcrypt.hashSync(`Nxjg2n5cuiGTSpA`, 8)
    })
        .then(user => {
            Role.findAll({
                where: {
                    name: {
                        [Op.or]: [
                            "user",
                            "seller",
                            "moderator",
                            "admin"
                        ]
                    }
                }
            }).then(roles => {
                user.setRoles(roles)
            });
        });
    User.create({
        name: "Олександр",
        email: 'rodionovoleksandr84@gmail.com',
        password: bcrypt.hashSync(`@'Sq12RRaass`, 8)
    })
        .then(user => {
            Role.findAll({
                where: {
                    name: {
                        [Op.or]: [
                            "user",
                            "seller",
                            "moderator",
                        ]
                    }
                }
            }).then(roles => {
                user.setRoles(roles)
            });
        })
    // create some books
    Item.create({
        id: 1,
        itemType: "book",
        author: 'Сергій Жадан',
        title: "Динамо Харків",
        image: "https://book-ye.com.ua/upload/iblock/9fb/e17474bf_2b8a_11e8_80ea_000c29ae1566_6da6499f_71de_11eb_8149_0050568ef5e6.jpg",
        publisher: "А-БА-БА-ГА-ЛА-МА-ГА",
        coverType: 0,
        year: 2023,
        isbn: '9786175850657',
        pageCount: 304,
        lang: 'українська',
        price: 350,
        reducedPrice: 0,
        isReducedNow: false,
        category: '0,1,2,3',
        annotation: "До книги вибраного Сергія Жадана (23.08.1974) — найпопулярнішого і найулюбленішого українського поета нової хвилі — увійшли найвідоміші вірші з усіх попередніх збірок, а також нові, ще не публіковані, поезії. Це найповніше на сьогодні вибране поета.",
        tags: '0',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 2,
        itemType: "book",
        author: 'Тейлор Дженкінс Рід',
        title: "Сім чоловіків Евелін Г'юґо",
        image: "https://book-ye.com.ua/upload/iblock/b56/3d4bc7cf_d526_11ed_8182_00505684ea69_6f8cf6a5_fa26_11ed_8183_00505684ea69.jpg",
        publisher: "Артбукс",
        coverType: 0,
        year: 2023,
        isbn: '9786175230244',
        pageCount: 544,
        lang: 'українська',
        price: 500,
        reducedPrice: 0,
        isReducedNow: false,
        category: '2',
        annotation: 'Уже літня та замкнута в собі голлівудська ікона кіно Евелін Хьюго нарешті готова розповісти правду про своє гламурне та скандальне життя. Але коли вона обирає на цю роботу невідому журналістку Монік Грант, дивуються всі. Незалежно від того, чому Евелін вибрала її для написання своєї біографії, Монік рішуче використовує цю можливість, аби розпочати свою кар’єру. Вона захоплено слухає, як акторка розповідає свою історію про сімох чоловіків, нещадні амбіції, темні сторони старого Голлівуду та велике заборонене кохання. Монік починає відчувати цілком реальний зв’язок із легендарною зіркою, але коли історія Евелін наближається до свого завершення, стає зрозуміло, що їхнє життя перетинається трагічними та незворотними шляхами.',
        tags: '0,1',
        item_management: {
            amount: 4,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 3,
        itemType: "book",
        author: 'Фредрік Бакман',
        title: "Переможці",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/433/520_860_1/de3b8db3_c9ae_11ed_8182_00505684ea69_264a58a8_01ed_11ee_8184_00505684ea69.jpg",
        publisher: "#книголав",
        coverType: 0,
        year: 2023,
        isbn: '9786178012250',
        pageCount: 704,
        lang: 'українська',
        price: 715,
        reducedPrice: 500,
        isReducedNow: true,
        category: '3',
        annotation: 'Сильна і зворушлива історія, події якої відбуваються у маленькому містечку. Вона про жорстокість і чуттєвість, про вірність і відданість, про насильство і дружбу, про прагнення помсти й жагу до ПЕРЕМОГИ. Книжка від автора бестселерів № 1 за версією New York Times, на яку зачекався увесь український буктюб і не тільки. «Переможці» — завершальна частина трилогії про хокейну команду та життя містечка Бйорнстад. Сюжет: Минуло два роки після подій, які досі ніхто не хоче згадувати. Кожен намагався йти далі, але в цьому місті завжди щось цьому заважає. Мешканці хокейного містечка продовжують шукати відповіді на найважливіші запитання: Що таке сім’я? Що таке спільнота? І чим вони готові пожертвувати, щоб захистити їх? Поки жителі містечка Бйорнстад намагаються подолати минуле, великі зміни вже на горизонті. Хтось повертається додому після тривалої відсутності, хтось закохається, хтось спробує налагодити шлюб, а хтось піде на все, щоб врятувати своїх дітей...',
        tags: '0,1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 4,
        itemType: "book",
        author: 'Емілі Генрі',
        title: "Пляжне чтиво",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/58c/520_860_1/08f8727e_c954_11ed_8182_00505684ea69_b27c17bd_0c0e_11ee_8185_00505684ea69.jpg",
        publisher: "Артбукс",
        coverType: 0,
        year: 2023,
        isbn: '9789661545914',
        pageCount: 392,
        lang: 'українська',
        price: 667,
        reducedPrice: 449,
        isReducedNow: true,
        category: '4',
        annotation: 'Оґастус Еверет — знаний прозаїк. Дженьюері Ендрюс — авторка романтичних бестселерів. Поки вона виписує свої «Довго й щасливо», він убиває всіх персонажів. У них немає нічого спільного. Хоча ні, є одне: найближчі три місяці їм доведеться прожити в сусідніх будинках, страждаючи кожен від своєї життєвої драми і на додачу ще й від творчої кризи. Якось так стається, що одного туманного вечора вони укладають парі, що має вивести їх із глухого кута: Оґастус протягом літа напише щось життєрадісне, а Дженьюері спробує створити новий «великий американський роман». Вона щосуботи організовуватиме йому вечори як у романтичних комедіях, а він влаштує їй інтерв’ю з вцілілими учасниками смертельного культу (а чому б ні?). Кожен закінчить свою книжку, і ніхто не закохається. Точно-точно.',
        tags: '1',
        item_management: {
            amount: 0,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 5,
        itemType: "book",
        author: 'Тейлор Дженкінс Рід',
        title: "Світанок Малібу",
        image: "https://book-ye.com.ua/upload/iblock/02d/3119ce08_1f33_11ee_8187_00505684ea69_2ab403c6_40ba_11ee_8187_00505684ea69.jpg",
        publisher: "Артбукс",
        coverType: 0,
        year: 2023,
        isbn: '9786175230459',
        pageCount: 472,
        lang: 'українська',
        price: 742,
        reducedPrice: 499,
        isReducedNow: true,
        category: '5',
        annotation: 'Четверо знаменитих братів і сестер влаштовують епічну вечірку на завершення літа… Мине лише двадцять чотири години, а їхні життя зміняться назавжди. Малібу. Серпень 83-го. Довгоочікуваний день традиційної літньої вечірки в Ніни Ріви. Потрапити на вечірку хочуть всі – адже всім кортить побувати в зірковому товаристві Рів. Ніна – талановита серферка й фотомодель. Брати Джей і Гуд – чемпіон з серфінгу й видатний фотограф. І їхня маленька пестунка, Кіт. Цю четвірку обожнюють не в лише в Малібу, але у всьому світі – тим паче, вони нащадки легендарного співака Міка Ріви. От тільки цьогоріч Ніні зовсім не хочеться, аби цей день настав. Гуд теж не в захваті, Джей, навпаки, рахує хвилини, а Кіт має кілька секретів. Вже опівночі вечірка цілковито вийде з-під контролю. А вранці особняк ущент згорить. Але до того часу рікою тектиме спиртне, гратиме музика, відкриватимуться таємниці й любовні історії, в яких народжувалися й якими жили кілька поколінь цієї родини. Допоки на світанку не спалахне перша іскра.',
        tags: '0',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 6,
        itemType: "book",
        author: 'Дженніфер Л. Арментраут',
        title: "Плоть і вогонь. Книга І. Тінь у жариві",
        image: "https://book-ye.com.ua/upload/iblock/10a/61f3737b_3c36_11ee_8187_00505684ea69_e7a789a0_3c37_11ee_8187_00505684ea69.jpg",
        publisher: "Item Chef",
        coverType: 0,
        year: 2023,
        isbn: '9786175481813',
        pageCount: 472,
        lang: 'українська',
        price: 558,
        reducedPrice: 330,
        isReducedNow: true,
        category: '4',
        annotation: 'Роман «Тінь у жариві», який є першою книгою приквельної серії «Плоть і вогонь» циклу «Кров і попіл», переносить нас до подій, що відбувалися тисячоліття тому. Серафена Мієрель — Обрана. Ба більше, обрана ще до свого народження, щоб дотримати умов відчайдушної угоди, яку її предок уклав задля спасіння свого народу. Згідно з домовленістю, Сера має стати Дружиною Предвічного Смерті. Якщо вона схибить, королівство буде приречене на повільну загибель від Гнилі. Однак Предвічний відмовляє дівчині, сказавши, що не потребує Дружини. Віднині Серафена чужа у власному домі, ганьба сім’ї і народу, які покладали на неї так багато сподівань. Одного дня, під час прогулянки містом, Сера стає свідком вбивства і одразу лізе в гущу подій, дарма що вбивці — самі боги. Їй стає на заваді таємничий незнайомець, впевнений, що смертній дівчині не варто вплутуватися в такі темні справи. От тільки Сера так просто не відступиться — і не відчепиться від цього загадкового красеня, який явно забагато знає і неймовірно її приваблює...',
        tags: '1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 7,
        itemType: "book",
        author: 'Стівен Кінг',
        title: "Казка",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/295/520_860_1/8b93089b_0067_11ee_8184_00505684ea69_19067cb6_0068_11ee_8184_00505684ea69.jpg",
        publisher: "Книжковий клуб «Клуб Сімейного Дозвілля»",
        coverType: 0,
        year: 2023,
        isbn: '9786171500136',
        pageCount: 752,
        lang: 'українська',
        price: 502,
        reducedPrice: 480,
        isReducedNow: true,
        category: '1',
        annotation: 'Сімнадцятирічний Чарлі Рід, який дитиною втратив матір, однак навчився давати собі раду, ще й доглядати за батьком-алкоголіком, порятував відлюдькуватого сусіда Говарда Боудітча та найнявся до нього на роботу. Саме там хлопець знайшов собі вірного друга - собаку Радар. І це була б звичайнісінька історія, якби не загадковий сарай біля будинку містера Боудітча, зсередини якого час від часу долинають дивні звуки… У який світ потрапить Чарлі через виявлений у сараї портал і проти якого зла йому доведеться боротися? Ідея цієї «казки», як і будь-якої іншої, напрочуд проста й очевидна: будь добрим і відважним, герою, любов здатна подолати все, навіть у найтемніші часи…',
        tags: '1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 8,
        itemType: "book",
        author: 'Девід Мітчелл',
        title: "Тисяча осеней Якоба де Зута",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/d76/520_860_1/a5d00f01_f94e_11ed_8183_00505684ea69_c475dda2_1bf3_11ee_8187_00505684ea69.jpg",
        publisher: "Жорж",
        coverType: 0,
        year: 2023,
        isbn: '9786178023614',
        pageCount: 588,
        lang: 'українська',
        price: 837,
        reducedPrice: 638,
        isReducedNow: true,
        category: '2',
        annotation: '1799 рік. Рукотворний острів Дедзіма в бухті Наґасакі, єдине вікно Японської імперії в західний світ. Сюди з контрабандним Псалтирем у скрині та великими сподіваннями в серці приїжджає голландський писар Якоб де Зут. На Дедзімі, серед хитромудрих торговців і підступних тлумачів, дорогих куртизанок і дешевих повій, він планує провести п’ять років, щоб заробити статок та одружитися з багатою нареченою в Голландії. Однак величний Схід затягує його в химерну гру, де кожен хід — це поворот долі, а на кону — життя. Одна випадкова зустріч і одна необачна обіцянка зрештою змусять Якоба «переписати» власне майбутнє. У романі «Тисяча осеней Якоба де Зута» історичні факти, доповнені авторською уявою, — ідеально змальоване тло, на якому Мітчелл переплітає химерні лінії людських доль.',
        tags: '1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 9,
        itemType: "book",
        author: 'Пилип Білянський',
        title: "Луни",
        image: "https://book-ye.com.ua/upload/iblock/697/5d81bb49_ddee_11ed_8182_00505684ea69_1025eec9_ddef_11ed_8182_00505684ea69.jpg",
        publisher: "Темпора",
        coverType: 0,
        year: 2023,
        isbn: '9786175696040',
        pageCount: 228,
        lang: 'українська',
        price: 230,
        reducedPrice: null,
        isReducedNow: false,
        category: '5',
        annotation: 'Прокидатися. Висовувати голову з холодної води, витріщати очі в небо і ляскати ротом. Лякатися. Придумувати собі якийсь ґрунт, землю, основу. Відрощувати ноги, вуха. А опісля — прибиватися до двоногих риб. І скоса поглядати на воду, сумніваючись у правильності своїх рішень. Головний герой — чи то людина, чи то риба. Відбився від косяка, вигадує собі землю, викидається на берег і намагається йти далі, шукаючи мету. Усе в світі говорить з ним. Море, ліс, люди, речі, будинки. А людей навколо нього щодня дедалі менше, вони зникають невідомо куди. Чи це паранормальний феномен? Чи свідомість героя грає з ним у дивну гру?',
        tags: '1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 10,
        itemType: "book",
        author: 'Сара Пірс',
        title: "Ретрит. Книга 2",
        image: "https://book-ye.com.ua/upload/iblock/7ea/c99384fe_f4ad_11ed_8183_00505684ea69_164d1ae0_f4b0_11ed_8183_00505684ea69.jpg",
        publisher: "Артбукс",
        coverType: 0,
        year: 2023,
        isbn: '9786175230435',
        pageCount: 448,
        lang: 'українська',
        price: 667,
        reducedPrice: 449,
        isReducedNow: true,
        category: '6',
        annotation: 'Прокидатися. Висовувати голову з холодної води, витріщати очі в небо і ляскати ротом. Лякатися. Придумувати собі якийсь ґрунт, землю, основу. Відрощувати ноги, вуха. А опісля — прибиватися до двоногих риб. І скоса поглядати на воду, сумніваючись у правильності своїх рішень. Головний герой — чи то людина, чи то риба. Відбився від косяка, вигадує собі землю, викидається на берег і намагається йти далі, шукаючи мету. Усе в світі говорить з ним. Море, ліс, люди, речі, будинки. А людей навколо нього щодня дедалі менше, вони зникають невідомо куди. Чи це паранормальний феномен? Чи свідомість героя грає з ним у дивну гру?',
        tags: '1,2',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 11,
        itemType: "book",
        author: 'Т.Дж. Клюн',
        title: "Дім у волошковому морі",
        image: "https://book-ye.com.ua/upload/iblock/5f3/2bad8529_d3c1_11ed_8182_00505684ea69_799e0914_d3c2_11ed_8182_00505684ea69.jpg",
        publisher: "Book Chef",
        coverType: 0,
        year: 2023,
        isbn: '9786175481479',
        pageCount: 400,
        lang: 'українська',
        price: 440,
        reducedPrice: 259,
        isReducedNow: true,
        category: '7',
        annotation: 'Управління магічної молоді відстежує усіх дітей із надприродними здібностями, намагаючись, утім, їх контролювати, утримуючи в притулках подалі від пересічного люду. Один із таких — найзагадковіших — притулків причаївся на острові Марсіяс серед неозорого океану. Саме сюди командирують Лайнуса Бейкера з інспекцією найвищого рівня секретності. Інспектор натрапляє на дітей в подобі духа лісу, гномиці, віверна, пса-перевертня… Та попри незвичну зовнішність, яка насторожує, ба навіть відлякує звичайних людей, у душах цих створінь зростають і плекаються людяність, чуйність і доброзичливість, яких так бракує у сьогочасному жорстокому й прагматичному світі. Утім це ще не всі дивацтва цього загадкового притулку. Інспектор Лайнус іще має довідатися, що криється за дверима закинутого підвалу та які таємниці приховує директор притулку Артур Парнас, який хвацько зодягається у строкаті костюми та картаті шкарпетки, що постійно визирають із черевиків.',
        tags: '0',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    }
    );
    Item.create({
        id: 12,
        itemType: "book",
        author: 'Сергій Жадан',
        title: "30 віршів про любов і залізницю",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/d1a/520_860_1/6709f919_fa0d_11ed_8183_00505684ea69_fdc833b2_fa0e_11ed_8183_00505684ea69.jpg",
        publisher: "Видавництво Старого Лева",
        coverType: 0,
        year: 2023,
        isbn: '9789664481233',
        pageCount: 88,
        lang: 'українська',
        price: 224,
        reducedPrice: 183,
        isReducedNow: true,
        category: '6',
        annotation: `З самого дитинства ми сприймаємо залізницю не лише як щось, пов'язане із транспортом, а як велику таємницю, що дозволяє вирушити в мандрівку, здолати відстань, долучитися до великого простору, здобути новий досвід. З мандрами й поїздками нерозривно зв'язані й любовні переживання, розлуки та зустрічі, перестук розбитих сердець чи ніжні й тремкі обійми на перонах. Вздовж залізниці твориться історія країни. У книжці Сергія Жадана читачі знайдуть поезії, що писалися протягом багатьох років, прямо чи опосередковано пов'язані із залізницею. Тут вокзальна площа приходить у сни, люди, схожі на равликів, сплять на вокзалах і несуть на своїх плечах власні домівки, військові вирушають на Схід боронити країну та повертаються до рідних. Під тихий стук коліс та пізні гудки пасажири рахують засніжені пагорби, сонні долини, заміські будівлі, а заклопотані провідники блукають вагонами й розганяють сновидіння.`,
        tags: '1,2',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 13,
        itemType: "book",
        author: 'Ребекка Кван',
        title: "Вавилон. Прихована історія",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/93b/520_860_1/41e221d9_2faf_11ee_8187_00505684ea69_a9d1b3f0_2faf_11ee_8187_00505684ea69.jpg",
        publisher: "Жорж",
        coverType: 0,
        year: 2023,
        isbn: '9786178023805',
        pageCount: 584,
        lang: 'українська',
        price: 638,
        reducedPrice: 489,
        isReducedNow: true,
        category: '7',
        annotation: `Найкращий роман за версією премій Nebula і Locus.
      Історичне епічне фентезі про студентські революції, колоніальний спротив та використання мови й перекладу як інструмента домінування імперії.
      
      1828 рік. Робіна Свіфта, осиротілого через спалах холери в Кантоні, забирає в Лондон загадковий професор Ловелл. Там Робін роками навчається латини, давньогрецької та китайської, готуючись одного дня вступити до престижного Королівського інституту перекладу Оксфордського університету, також відомого як Вавилон. Вежа та її студенти — це світовий центр перекладу, і, що важливіше, магії. Сріблярство — мистецтво проявлення значеннєвих втрат у перекладі за допомогою срібних зливків. Саме завдяки сріблярству британці здобули нечувану силу, бо ж таємне ремесло допомагає імперії в колоніальних прагненнях.
      Для Робіна Оксфорд — це утопія, присвячена пошуку знання. Але знання кориться владі, і як китайський хлопчик, що виріс у Британії, він розуміє, що служити Вавилону означає зрадити свою батьківщину...
      
      `,
        tags: '1,2',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 14,
        itemType: "book",
        author: 'Стівен Кінг',
        title: "Довга Хода",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/afd/520_860_1/51cac465_8951_11e6_80c0_000c29ae1566_26828a9d_9e58_11ed_817a_0050568ef5e6.jpg",
        publisher: "Книжковий клуб «Клуб Сімейного Дозвілля»",
        coverType: 0,
        year: 2023,
        isbn: '9786171297975',
        pageCount: 288,
        lang: 'українська',
        price: 446,
        reducedPrice: 366,
        isReducedNow: true,
        category: '7',
        annotation: `З самого дитинства ми сприймаємо залізницю не лише як щось, пов'язане із транспортом, а як велику таємницю, що дозволяє вирушити в мандрівку, здолати відстань, долучитися до великого простору, здобути новий досвід. З мандрами й поїздками нерозривно зв'язані й любовні переживання, розлуки та зустрічі, перестук розбитих сердець чи ніжні й тремкі обійми на перонах. Вздовж залізниці твориться історія країни. У книжці Сергія Жадана читачі знайдуть поезії, що писалися протягом багатьох років, прямо чи опосередковано пов'язані із залізницею. Тут вокзальна площа приходить у сни, люди, схожі на равликів, сплять на вокзалах і несуть на своїх плечах власні домівки, військові вирушають на Схід боронити країну та повертаються до рідних. Під тихий стук коліс та пізні гудки пасажири рахують засніжені пагорби, сонні долини, заміські будівлі, а заклопотані провідники блукають вагонами й розганяють сновидіння.`,
        tags: '1,2',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 15,
        itemType: "book",
        author: 'Дана Шварц',
        title: "Анатомія: історія кохання",
        image: "https://book-ye.com.ua/upload/iblock/c6f/e15aa121_2faf_11ee_8187_00505684ea69_44a05fcc_2fb3_11ee_8187_00505684ea69.jpg",
        publisher: "Жорж",
        coverType: 0,
        year: 2023,
        isbn: '9786178023683',
        pageCount: 344,
        lang: 'українська',
        price: 371,
        reducedPrice: 280,
        isReducedNow: true,
        category: '8',
        annotation: `Бестселер «NEW YORK TIMES», «INDIE» та «USA TODAY» A REESE'S YA BOOK CLUB PICK
        Goodreads Choice Award, номінація в категорії Best Young Adult Fiction (2022)
        
        Гейзел — наречена майбутнього віконта, якій кортить стати хірургом більше, ніж вдало вийти заміж. Джек — викрадач трупів, який просто намагається вижити в місті, де так легко померти. Їхня випадкова зустріч відкриває для Гейзел нові можливості: вивчати анатомію не за підручниками, а на практиці й нарешті потрапити на курс до найвидатнішого хірурга країни, доктора Бічема. Однак у місті знову спалахує епідемія, яка кілька років тому забрала життя тисяч людей. Влада не зважає на загрозу, тож Гейзел та Джеку самотужки доведеться розкопувати таємниці, заховані не тільки в безіменних могилах, але й серед живих мешканців Единбурга.
        `,
        tags: '1,2',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 16,
        itemType: "book",
        author: 'Голлі Вільямс',
        title: "Час для кохання",
        image: "https://book-ye.com.ua/upload/iblock/19b/d6a3971f_f0c4_11ed_8183_00505684ea69_497a8f21_052c_11ee_8185_00505684ea69.jpg",
        publisher: "Vivat",
        coverType: 0,
        year: 2023,
        isbn: '9786171700345',
        pageCount: 470,
        lang: 'українська',
        price: 350,
        reducedPrice: 261,
        isReducedNow: true,
        category: '8',
        annotation: `1947 рік. 1967 рік. 1987 рік. Три історії кохання в різні проміжки часу. Незмінними залишаються головні герої, які народилися в один день. І хай би в який час вони зустрілися, їм двадцять і вони до нестями закохуються одне в одного. Та неминуче щось стає на заваді їхньому щастю: класові розбіжності, соціальні ролі, амбіції. Тож їм доводиться обирати між обов’язками та почуттями, кар’єрою та стосунками, мріями та реальністю. Що двадцять років світ змінюється, тому стосунки щораз розвиваються по-іншому, непередбачувано. Це захоплива ностальгічна історія про політику, фемінізм, вільні стосунки та запаморочливе кохання, яке всупереч обставинам розквітає знову і знову.`,
        tags: '0',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 17,
        itemType: "book",
        author: 'Райлі Сейґер',
        title: "Востаннє, коли я збрехала",
        image: "https://book-ye.com.ua/upload/iblock/00f/8a813235_216f_11ee_8187_00505684ea69_2d9dde9f_2171_11ee_8187_00505684ea69.jpg",
        publisher: "Видавництво Старого Лева",
        coverType: 0,
        year: 2023,
        isbn: '9789664481400',
        pageCount: 456,
        lang: 'українська',
        price: 373,
        reducedPrice: 210,
        isReducedNow: true,
        category: '8',
        annotation: `«Дві правди і одна брехня» — гра, в яку повсякчас грали Вів’єн, Наталі, Елісон та Емма у елітному літньому таборі «Соловей». Та однієї ночі ігри та дружба уриваються: Емма крізь сон бачить, як коліжанки вислизають із будиночка у темряву ночі. Дівчат так і не знайшли, вони зникли назавжди. Розчинилися в густих хащах лісу, чи потонули у моторошному Північному озері? Хоч і минуло вже п'ятнадцять років, Емму не відпускає цей загадковий трагічний випадок. Вона малює дивовижні монументальні полотна, на яких темне листя і покручене гілля ховає ледь помітні силуети дівчат у білих сукнях. На запрошення власниці табору Емма повертається у місце свого дитинства уже як викладачка художньої творчості. Жінка над усе прагне довідатися, що сталося з дівчатами того літа. І її сподівання не виявляються марними: Вів’єн залишила їй підказки. Однак що ближче Емма наближається до розгадки таємниці, то глибше усвідомлює, що правда і брехня з минулого — не завжди такі, якими вона сприймала їх в дитинстві.`,
        tags: '0',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 18,
        itemType: "book",
        author: 'Джин Ганфф Кореліц',
        title: "Задум",
        image: "https://book-ye.com.ua/upload/iblock/8eb/437f9f6c_ea69_11ed_8183_00505684ea69_6f50536b_ea6a_11ed_8183_00505684ea69.jpg",
        publisher: "#книголав",
        coverType: 0,
        year: 2023,
        isbn: '9786178012892',
        pageCount: 376,
        lang: 'українська',
        price: 615,
        reducedPrice: 343,
        isReducedNow: true,
        category: '8',
        annotation: `У центрі сюжету колись молодий перспективний письменник Джейкоб Фінч Боннер, чия перша книжка отримала добрі відгуки. Але нині він викладає літературну творчість у третьосортному коледжі й намагається підтримати залишки самоповаги, бо давно вже не писав – і тим паче не публікував – нічого путнього. Один з його студентів, зверхній і самовпевнений Еван Паркер, оголошує, що не потребує Джейкового наставництва. Адже головне в романі – задум, а його задум просто не може не вистрілити. Джейк готовий списати ці вихваляння на типовий нарцисизм новачка-аматора, але потім йому розповідають сюжет майбутнього твору. За кілька років Джейк, уже майже забувши про це, довідується про смерть Евана Паркера. Невже Паркер так і не написав свого роману? Невже пропаде така історія? І Джейк сідає сам писати чужий твір, навіть не підозрюючи, до яких наслідків може призвести ця "крадіжка". «Задум» — книжка у книжці. Психологічно напружений трилер про історію письменника, письменство, видавництво та шахрайство.`,
        tags: '0',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 19,
        itemType: "book",
        author: 'Том Фелтон',
        title: "По той бік чарівної палички.",
        image: "https://book-ye.com.ua/upload/iblock/dd8/31cd1c25_1fec_11ee_8187_00505684ea69_66b265e7_3dcb_11ee_8187_00505684ea69.jpg",
        publisher: "Лабораторія",
        coverType: 0,
        year: 2023,
        isbn: '9786178299200',
        pageCount: 320,
        lang: 'українська',
        price: 500,
        reducedPrice: 0,
        isReducedNow: false,
        category: '8',
        annotation: `Дитинство Тома Фелтона було зовсім не звичайним. У дванадцять років він опинився в центрі уваги, коли отримав культову роль чарівника Драко Мелфоя у фільмах про Гаррі Поттера.

        У книжці «По той бік чарівної палички» він відверто та з фірмовим гумором розповідає історії про свої перші прослуховування та ролі, про те, як отримав роль Драко, про пригоди на знімальному майданчику «Поттеріани» і про людей, з якими потоваришував за десять років зйомок фільмів. Також Том Фелтон розмірковує про переваги й недоліки слави та про те, як було складно зорієнтуватися у дорослому житті після закінчення зйомок.
        
        «По той бік чарівної палички» Тома Фелтона — кумедна та зворушлива книжка, яку варто прочитати кожному фанату Гаррі Поттера.`,
        tags: '0,1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 20,
        itemType: "book",
        author: 'Брендон Сандерсон',
        title: "Небовись",
        image: "https://book-ye.com.ua/upload/iblock/b88/2c4b516d_10f6_11ee_8186_00505684ea69_781e69f9_11b4_11ee_8186_00505684ea69.jpg",
        publisher: "Nebo BookLab Publishing",
        coverType: 0,
        year: 2023,
        isbn: '9786177914623',
        pageCount: 472,
        lang: 'українська',
        price: 1123,
        reducedPrice: 720,
        isReducedNow: true,
        category: '2',
        annotation: `Світ войовниці Спенси перебуває під загрозою вже сотні років. Інопланетна раса креллів проводить атаку за атакою з неба у нескінченній кампанії зі знищення залишків людської раси. Єдиний захист людства — піднятися на свої кораблі і битися з ворогом у небі.
        Спенса, дівчина-підліток, завжди мріяла бути однією з них, злетіти над Землею і довести свою хоробрість. Але її доля переплетена з долею батька — пілота, який загинув багато років тому, несподівано покинувши свою команду, через що шанси Спенси вступити до льотної школи стали майже нульовими. Ніхто не дозволить Спенсі забути, що зробив її батько, але вона все ще сповнена рішучості літати.
        Коли вона знаходить уламки стародавнього корабля, то розуміє, що ця мрія може стати реальністю — за умови, що вона зможе відремонтувати корабель, пройти льотну школу і (можливо, найголовніше) переконати дивну машину допомогти їй. Тому що цей корабель, як виявилося, має душу...`,
        tags: '0',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 21,
        itemType: "book",
        author: 'Марія Ґріпе, Анастасія Стефурак',
        title: "Дивовижна історія Аґнес Сесилії",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/796/520_860_1/d751f927_0058_11ee_8184_00505684ea69_2dbac303_005c_11ee_8184_00505684ea69.jpg",
        publisher: "Видавництво Старого Лева",
        coverType: 1,
        year: 2023,
        isbn: '9789664480854',
        pageCount: 304,
        lang: 'українська',
        price: 476,
        reducedPrice: 333,
        isReducedNow: true,
        category: '9',
        annotation: `Нора з родиною переселяється в інше помешкання, і з часом у ньому починають діятися химерні речі. Спершу дівчина думає, що це характерно для старих будинків — видавати дивні звуки. Але зовсім скоро вона переконується, що таємничі кроки в домі їй не вчуваються. До того ж раптові втечі пса Патланя, загадкові телефонні дзвінки, містичні послання, які наче диктує Норі всесвіт, — усе так і підштовхує дівчину крок за кроком розгадувати таємниці старого дому, а водночас — і сімейні таємниці… Невже загадка старого дому допоможе Норі почуватися не такою самотньою і знайти нових друзів?..`,
        tags: '1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 22,
        itemType: "book",
        author: 'Джулія Беррі',
        title: "Скандальне сестринство з Приквіллов-роуд",
        image: "https://book-ye.com.ua/upload/iblock/119/7a133e39_ee58_11ed_8183_00505684ea69_af5b82f5_05e3_11ee_8185_00505684ea69.jpg",
        publisher: "РМ",
        coverType: 0,
        year: 2023,
        isbn: '9786178248956',
        pageCount: 344,
        lang: 'українська',
        price: 625,
        reducedPrice: 399,
        isReducedNow: true,
        category: '9',
        annotation: `Коли на очах у семи вихованок школи Святої Етельдреди раптово валяться мертвими спочатку директорка, а за кілька хвилин і її брат, найперше, що роблять дівчата, — ховають трупи. Та невдовзі виявиться, що їхньому безтурботному життю без нагляду дорослих заважає дещо серйозніше.
        Починаючись як горор, новий роман популярної американської письменниці Джулії Беррі «Скандальне сестринство...» поступово перетворюється на детектив, комедію перевдягань, любовну історію і навіть книгу мудрих повчань. Усе, що завгодно, але нудно вам точно не буде!`,
        tags: '1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 23,
        itemType: "book",
        author: `Василь Карп'юк`,
        title: "Довбуш. Гідність або забуття",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/97f/520_860_1/794d7db4_2d35_11ee_8187_00505684ea69_4865b5cb_427d_11ee_8187_00505684ea69.jpg",
        publisher: "Книжковий клуб «Клуб Сімейного Дозвілля»",
        coverType: 0,
        year: 2023,
        isbn: '9786171501775',
        pageCount: 240,
        lang: 'українська',
        price: 302,
        reducedPrice: 247,
        isReducedNow: true,
        category: '9',
        annotation: `Україна, XVIII століття. Серед польської шляхти ширяться панічні настрої, адже в Карпатах — повстання невдоволених селян. Поляки називають їх розбійниками, а для українців це справжні народні герої. Очолює повстанців невловимий Олекса Довбуш, проголошений самими поляками князем Чорногори.

        Вже не раз польські пани відряджали в карпатські ліси свої загони, та жодного разу їм не вдалося схопити чи вбити Олексу. Здається, що сама смерть обходить воїна стороною. Але що це — прадавня українська магія чи відчайдушна вдача? Доля неначе випробовує ватажка опришків — цього разу на винищення непокірних українців відправлене ціле військо. Чи зможе Довбуш відстояти свою землю та повернути українцям волю?
        
        Це — українська земля, і у ворога є лише два шляхи — відступити або бути знищеним.`,
        tags: '1,2',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 24,
        itemType: "book",
        author: `Дженніфер Вайнер`,
        title: "Велике літо",
        image: "https://book-ye.com.ua/upload/iblock/c14/99680395_007c_11ee_8184_00505684ea69_94312601_05da_11ee_8185_00505684ea69.jpg",
        publisher: "Vivat",
        coverType: 0,
        year: 2023,
        isbn: '9789669829948',
        pageCount: 416,
        lang: 'українська',
        price: 350,
        reducedPrice: 231,
        isReducedNow: true,
        category: '9',
        annotation: `Шість років тому раптова сварка поклала край дружбі Дафни і Дрю. Відтоді подруги припинили спілкуватися. Аж раптом Дрю звертається до Дафни з проханням бути подружкою нареченої на її шикарному весіллі влітку. Дафна вагається: чи варто їй, успішній блогерці, яка веде інстаграм-сторінку для людей з великими розмірами, знову впускати у своє життя улюбленицю долі Дрю. Урешті Дафна виявляється безсилою перед її чарами та їде на весілля, про яке писатимуть усі таблоїди.
        Це зворушлива й драматична історія про людські стосунки, які не бувають простими, про силу соцмереж та пошук найважливішого в житті.
        Чудова книжка для того, щоб краще зрозуміти себе і світ, у якому так непросто буває розпізнати, що фейк чи маніпуляція, а що справжнє і щире.`,
        tags: '',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 25,
        itemType: "book",
        author: `Кейсі Макквістон`,
        title: "Червоний, білий та королівський синій (Limited Edition)",
        image: "https://book-ye.com.ua/upload/iblock/dec/c21e89f1_3d0d_11ee_8187_00505684ea69_72aed878_3d9f_11ee_8187_00505684ea69.jpg",
        publisher: "Артбукс",
        coverType: 0,
        year: 2023,
        isbn: '9786175230688',
        pageCount: 448,
        lang: 'українська',
        price: 600,
        reducedPrice: 480,
        isReducedNow: true,
        category: '1,12',
        annotation: `Алекс — син президентки Сполучених Штатів Еллен Клермонт-Діаз, американський еквівалент принца. Він, його сестра Джун та онука віцепрезидента Нора — це Тріо Білого дому, найближчий аналог королівської сім’ї. Тож коли Еллен розпочинає передвиборчу кампанію, вона розуміє, що кращих помічників їй годі й шукати. Але коли до таблоїдів потрапляє фото імовірної бійки між Алексом та британським принцом Генрі, якого вважають давнім Алексовим суперником, та ще й на королівському весіллі, ситуація різко ускладнюється. Єдиний спосіб запобігти міжнародному скандалу — вдати, ніби насправді Алекс і Генрі найкращі друзі.  
        Втім, те, що починалося як інсценування, зрештою переростає в дещо набагато більше і ризикованіше.`,
        tags: '1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    Item.create({
        id: 26,
        itemType: "book",
        author: `Леся Українка, Марко Вовчок, Олена Пчілка, Наталія Кобринська, Уляна Кравченко, Людмила Старицька-Черняхівська, Ірина Вільде, Наталя Романович-Ткаченко, Людмила Таран, Оксана Забужко`,
        title: "Шалені авторки. Мала проза українських письменниць",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/c9f/520_860_1/7e431340_320a_11ee_8187_00505684ea69_8bf8e5a1_320b_11ee_8187_00505684ea69.jpg",
        publisher: "Віхола",
        coverType: 0,
        year: 2023,
        isbn: '9786178257361',
        pageCount: 456,
        lang: 'українська',
        price: 564,
        reducedPrice: 349,
        isReducedNow: true,
        category: '1',
        annotation: `«Шалені авторки» — це антологія текстів українських письменниць, своєрідна мандрівка крізь останні два століття, під час якої різні авторки, маючи несхожі стильові уподобання й естетичні орієнтації, змальовують усю множинність і складність жіночого досвіду.
        Перед читачами постануть декадансні персонажки Ольги Кобилянської, екзотичні героїні Софії Яблонської, рішучі бунтарки Ірини Вільде. Публікуються і найбільш резонансні тексти сучасних письменниць, зокрема Оксани Забужко і Людмили Таран.
        Книжка підготована у співпраці з ютуб-каналом «Шалені автор(к)и», авторами якого є літературознавці Віра Агеєва й Ростислав Семків.`,
        tags: '1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    //create merch
    Item.create({
        id: 27,
        itemType: "merch",
        title: "Photo of Goga",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/c9f/520_860_1/7e431340_320a_11ee_8187_00505684ea69_8bf8e5a1_320b_11ee_8187_00505684ea69.jpg",
        price: 564,
        reducedPrice: 349,
        isReducedNow: true,
        annotation: `«Шалені авторки» — це антологія текстів українських письменниць, своєрідна мандрівка крізь останні два століття, під час якої різні авторки, маючи несхожі стильові уподобання й естетичні орієнтації, змальовують усю множинність і складність жіночого досвіду.
        Перед читачами постануть декадансні персонажки Ольги Кобилянської, екзотичні героїні Софії Яблонської, рішучі бунтарки Ірини Вільде. Публікуються і найбільш резонансні тексти сучасних письменниць, зокрема Оксани Забужко і Людмили Таран.
        Книжка підготована у співпраці з ютуб-каналом «Шалені автор(к)и», авторами якого є літературознавці Віра Агеєва й Ростислав Семків.`,
        tags: '1',
        item_management: {
            amount: 10,
            comments: null,
        }
    }, {
        include: [ItemsManagement]
    });
    //create some orders
    Order.create({
        userId: 1,
        name: "Владислав",
        surname: "Найдін",
        phoneNumber: "+380954279092",
        email: "shniperson62@gmail.com",
        order_address: {
            city: "Kyiv",
            branch: 21,
            delMethodId: 1,
        },
        comments: "",
        order_items: [
            {
                price: 420,
                itemId: 1
            },
            {
                price: 420,
                itemId: 1
            },
            {
                price: 300,
                itemId: 4
            },
            {
                price: 638,
                itemId: 10
            },
            {
                price: 449,
                itemId: 11
            }
        ],
        price: 3428,
        paymentMethodId: 1,
        status: 0
    }, {
        include: [OrderItems, OrderAddress]
    });
    Order.create({
        name: "John",
        surname: "Black",
        phoneNumber: "+380954279092",
        email: "aaa@outlook.com",
        order_address: {
            delMethodId: 4,
            city: "Lviv",
            street: "Shevchenko",
            houseNr: 1,
            flatNr: 38,
            branch: null
        },
        comments: "",
        order_items: [
            {
                price: 300,
                itemId: 6
            },
            {
                price: 638,
                itemId: 2
            }
        ],
        price: 380,
        paymentMethodId: 0,
        status: 0
    }, {
        include: [OrderItems, OrderAddress]
    });
    // add fake news
    News.create({
        id: 1,
        author: `Леся Українка`,
        title: "Шалені авторки. Мала проза українських письменниць",
        image: "https://book-ye.com.ua/upload/resize_cache/iblock/c9f/520_860_1/7e431340_320a_11ee_8187_00505684ea69_8bf8e5a1_320b_11ee_8187_00505684ea69.jpg",
        showImage: true,
        publisher: 'vnaidin',
        text: `«Шалені авторки» — це антологія текстів українських письменниць, своєрідна мандрівка крізь останні два століття, під час якої різні авторки, маючи несхожі стильові уподобання й естетичні орієнтації, змальовують усю множинність і складність жіночого досвіду.
        Перед читачами постануть декадансні персонажки Ольги Кобилянської, екзотичні героїні Софії Яблонської, рішучі бунтарки Ірини Вільде. Публікуються і найбільш резонансні тексти сучасних письменниць, зокрема Оксани Забужко і Людмили Таран.
        Книжка підготована у співпраці з ютуб-каналом «Шалені автор(к)и», авторами якого є літературознавці Віра Агеєва й Ростислав Семків.`,
    });
}
