const express = require("express");
const cors = require("cors");
const path = require('path');

const app = express();
require('dotenv').config();
const PORT = process.env.APP_PORT || 3016;

var corsOptions = {
  origin: process.env.APP_MODE === 'development' ? 'http://localhost:3015' : `http://localhost:${PORT}`
};

const bodyParser = require("body-parser");

const swaggerJsdoc = require("swagger-jsdoc");
const swaggerUi = require("swagger-ui-express");
const options = {
  definition: {
    openapi: "3.0.3",
    info: {
      title: "Digital Bookstore CRUD",
      description: "Digital Bookstore Application API",
      license: {
        "name": "MIT",
        "url": "https://opensource.org/licenses/MIT"
      },
      version: "1.0.11"
    },
    servers: [
      {
        url: `http://localhost:${PORT}/api/`,
      },
    ],
    // schemes: ["http"],
    components: {
      securitySchemes: {
        bearer: {
          type: "http",
          scheme: "bearer",
          in: 'header',
          bearerFormat: 'bearer'
        },
      },
    },
  },
  apis: ["./app/routes/*.js"],
};

const specs = swaggerJsdoc(options);
app.use(
  "/api-docs",
  swaggerUi.serve,
  swaggerUi.setup(specs)
);
app.use(cors(corsOptions));

// parse requests of content-type - application/json
app.use(express.json());

// parse requests of content-type - application/x-www-form-urlencoded
app.use(express.urlencoded({ extended: true }));

// Have Node serve the files for our built React app
app.use(express.static(path.resolve(__dirname, '..//build')));
// folder for media
app.use(express.static(`${process.env.TOKEN_FILES_PATH}`, { maxAge: 43200 }));// caching for 12h

// database
const db = require("./app/models");
const Role = db.role;
const Order = db.order;
const Item = db.item;

db.sequelize.sync();
// force: true will drop the table if it already exists
/* db.sequelize.sync({force: true}).then(() => {
  console.log('Drop and Resync Database with { force: true }');
   initialDBFill();
 }); */

// routes
require('./app/routes/auth.route')(app);
require('./app/routes/user.route')(app);
require('./app/routes/item.route')(app);
require('./app/routes/order.route')(app);

// Handles any requests that don't match the ones above
app.get('*', (req, res) => {
  res.sendFile(path.resolve(__dirname,`..//build/index.html`));
});

// set port, listen for requests
app.listen(PORT, () => {
  console.log(`Server is running on port ${PORT}.`);
});

function initialDBFill() {
  // create roles
  Role.create({
    id: 1,
    name: "user"
  });
  Role.create({
    id: 2,
    name: "moderator"
  });
  Role.create({
    id: 3,
    name: "admin"
  });
  // create some users
  /* User.create({//FIXME: not setting hash in pw, no roles
    id:1,
    email:'first@google.com',
    password:'first',
    
  });
  User.create({
    id:2,
    email:'second@google.com',
    password:'second',
    roles: [
      "user",
      "moderator",
    ]
  });
  User.create({
    id:3,
    email:'third@google.com',
    password:'third',
    roles: [
      "user",
      "moderator",
    ]
  }); */
  // create some books
  Item.create({
    id: 1,
    itemType: "book",
    author: 'Сергій Жадан',
    title: "Динамо Харків",
    image: "https://book-ye.com.ua/upload/iblock/9fb/e17474bf_2b8a_11e8_80ea_000c29ae1566_6da6499f_71de_11eb_8149_0050568ef5e6.jpg",
    publisher: "А-БА-БА-ГА-ЛА-МА-ГА",
    year: 2023,
    isbn: '9786175850657',
    pageCount: 304,
    lang: 'українська',
    price: 350,
    reducedPrice: null,
    isReducedNow: false,
    annotation: "До книги вибраного Сергія Жадана (23.08.1974) — найпопулярнішого і найулюбленішого українського поета нової хвилі — увійшли найвідоміші вірші з усіх попередніх збірок, а також нові, ще не публіковані, поезії. Це найповніше на сьогодні вибране поета.",
    tags: 'top'
  });
  Item.create({
    id: 2,
    itemType: "book",
    author: 'Тейлор Дженкінс Рід',
    title: "Сім чоловіків Евелін Г'юґо",
    image: "https://book-ye.com.ua/upload/iblock/b56/3d4bc7cf_d526_11ed_8182_00505684ea69_6f8cf6a5_fa26_11ed_8183_00505684ea69.jpg",
    publisher: "Артбукс",
    year: 2023,
    isbn: '9786175230244',
    pageCount: 544,
    lang: 'українська',
    price: 500,
    reducedPrice: null,
    isReducedNow: false,
    annotation: 'Уже літня та замкнута в собі голлівудська ікона кіно Евелін Хьюго нарешті готова розповісти правду про своє гламурне та скандальне життя. Але коли вона обирає на цю роботу невідому журналістку Монік Грант, дивуються всі. Незалежно від того, чому Евелін вибрала її для написання своєї біографії, Монік рішуче використовує цю можливість, аби розпочати свою кар’єру. Вона захоплено слухає, як акторка розповідає свою історію про сімох чоловіків, нещадні амбіції, темні сторони старого Голлівуду та велике заборонене кохання. Монік починає відчувати цілком реальний зв’язок із легендарною зіркою, але коли історія Евелін наближається до свого завершення, стає зрозуміло, що їхнє життя перетинається трагічними та незворотними шляхами.',
    tags: 'top,new'
  });
  Item.create({
    id: 3,
    itemType: "book",
    author: 'Фредрік Бакман',
    title: "Переможці",
    image: "https://book-ye.com.ua/upload/resize_cache/iblock/433/520_860_1/de3b8db3_c9ae_11ed_8182_00505684ea69_264a58a8_01ed_11ee_8184_00505684ea69.jpg",
    publisher: "#книголав",
    year: 2023,
    isbn: '9786178012250',
    pageCount: 704,
    lang: 'українська',
    price: 715,
    reducedPrice: 500,
    isReducedNow: true,
    annotation: 'Сильна і зворушлива історія, події якої відбуваються у маленькому містечку. Вона про жорстокість і чуттєвість, про вірність і відданість, про насильство і дружбу, про прагнення помсти й жагу до ПЕРЕМОГИ. Книжка від автора бестселерів № 1 за версією New York Times, на яку зачекався увесь український буктюб і не тільки. «Переможці» — завершальна частина трилогії про хокейну команду та життя містечка Бйорнстад. Сюжет: Минуло два роки після подій, які досі ніхто не хоче згадувати. Кожен намагався йти далі, але в цьому місті завжди щось цьому заважає. Мешканці хокейного містечка продовжують шукати відповіді на найважливіші запитання: Що таке сім’я? Що таке спільнота? І чим вони готові пожертвувати, щоб захистити їх? Поки жителі містечка Бйорнстад намагаються подолати минуле, великі зміни вже на горизонті. Хтось повертається додому після тривалої відсутності, хтось закохається, хтось спробує налагодити шлюб, а хтось піде на все, щоб врятувати своїх дітей...',
    tags: 'top,new'
  });
  Item.create({
    id: 4,
    itemType: "book",
    author: 'Емілі Генрі',
    title: "Пляжне чтиво",
    image: "https://book-ye.com.ua/upload/resize_cache/iblock/58c/520_860_1/08f8727e_c954_11ed_8182_00505684ea69_b27c17bd_0c0e_11ee_8185_00505684ea69.jpg",
    publisher: "Артбукс",
    year: 2023,
    isbn: '9789661545914',
    pageCount: 392,
    lang: 'українська',
    price: 667,
    reducedPrice: 449,
    isReducedNow: true,
    annotation: 'Оґастус Еверет — знаний прозаїк. Дженьюері Ендрюс — авторка романтичних бестселерів. Поки вона виписує свої «Довго й щасливо», він убиває всіх персонажів. У них немає нічого спільного. Хоча ні, є одне: найближчі три місяці їм доведеться прожити в сусідніх будинках, страждаючи кожен від своєї життєвої драми і на додачу ще й від творчої кризи. Якось так стається, що одного туманного вечора вони укладають парі, що має вивести їх із глухого кута: Оґастус протягом літа напише щось життєрадісне, а Дженьюері спробує створити новий «великий американський роман». Вона щосуботи організовуватиме йому вечори як у романтичних комедіях, а він влаштує їй інтерв’ю з вцілілими учасниками смертельного культу (а чому б ні?). Кожен закінчить свою книжку, і ніхто не закохається. Точно-точно.',
    tags: 'new'
  });
  Item.create({
    id: 5,
    itemType: "book",
    author: 'Тейлор Дженкінс Рід',
    title: "Світанок Малібу",
    image: "https://book-ye.com.ua/upload/iblock/02d/3119ce08_1f33_11ee_8187_00505684ea69_2ab403c6_40ba_11ee_8187_00505684ea69.jpg",
    publisher: "Артбукс",
    year: 2023,
    isbn: '9786175230459',
    pageCount: 472,
    lang: 'українська',
    price: 742,
    reducedPrice: 499,
    isReducedNow: true,
    annotation: 'Четверо знаменитих братів і сестер влаштовують епічну вечірку на завершення літа… Мине лише двадцять чотири години, а їхні життя зміняться назавжди. Малібу. Серпень 83-го. Довгоочікуваний день традиційної літньої вечірки в Ніни Ріви. Потрапити на вечірку хочуть всі – адже всім кортить побувати в зірковому товаристві Рів. Ніна – талановита серферка й фотомодель. Брати Джей і Гуд – чемпіон з серфінгу й видатний фотограф. І їхня маленька пестунка, Кіт. Цю четвірку обожнюють не в лише в Малібу, але у всьому світі – тим паче, вони нащадки легендарного співака Міка Ріви. От тільки цьогоріч Ніні зовсім не хочеться, аби цей день настав. Гуд теж не в захваті, Джей, навпаки, рахує хвилини, а Кіт має кілька секретів. Вже опівночі вечірка цілковито вийде з-під контролю. А вранці особняк ущент згорить. Але до того часу рікою тектиме спиртне, гратиме музика, відкриватимуться таємниці й любовні історії, в яких народжувалися й якими жили кілька поколінь цієї родини. Допоки на світанку не спалахне перша іскра.',
    tags: 'top'
  });
  Item.create({
    id: 6,
    itemType: "book",
    author: 'Дженніфер Л. Арментраут',
    title: "Плоть і вогонь. Книга І. Тінь у жариві",
    image: "https://book-ye.com.ua/upload/iblock/10a/61f3737b_3c36_11ee_8187_00505684ea69_e7a789a0_3c37_11ee_8187_00505684ea69.jpg",
    publisher: "Item Chef",
    year: 2023,
    isbn: '9786175481813',
    pageCount: 472,
    lang: 'українська',
    price: 558,
    reducedPrice: 330,
    isReducedNow: true,
    annotation: 'Роман «Тінь у жариві», який є першою книгою приквельної серії «Плоть і вогонь» циклу «Кров і попіл», переносить нас до подій, що відбувалися тисячоліття тому. Серафена Мієрель — Обрана. Ба більше, обрана ще до свого народження, щоб дотримати умов відчайдушної угоди, яку її предок уклав задля спасіння свого народу. Згідно з домовленістю, Сера має стати Дружиною Предвічного Смерті. Якщо вона схибить, королівство буде приречене на повільну загибель від Гнилі. Однак Предвічний відмовляє дівчині, сказавши, що не потребує Дружини. Віднині Серафена чужа у власному домі, ганьба сім’ї і народу, які покладали на неї так багато сподівань. Одного дня, під час прогулянки містом, Сера стає свідком вбивства і одразу лізе в гущу подій, дарма що вбивці — самі боги. Їй стає на заваді таємничий незнайомець, впевнений, що смертній дівчині не варто вплутуватися в такі темні справи. От тільки Сера так просто не відступиться — і не відчепиться від цього загадкового красеня, який явно забагато знає і неймовірно її приваблює...',
    tags: 'new'
  });
  Item.create({
    id: 7,
    itemType: "book",
    author: 'Стівен Кінг',
    title: "Казка",
    image: "https://book-ye.com.ua/upload/resize_cache/iblock/295/520_860_1/8b93089b_0067_11ee_8184_00505684ea69_19067cb6_0068_11ee_8184_00505684ea69.jpg",
    publisher: "Книжковий клуб «Клуб Сімейного Дозвілля»",
    year: 2023,
    isbn: '9786171500136',
    pageCount: 752,
    lang: 'українська',
    price: 502,
    reducedPrice: 480,
    isReducedNow: true,
    annotation: 'Сімнадцятирічний Чарлі Рід, який дитиною втратив матір, однак навчився давати собі раду, ще й доглядати за батьком-алкоголіком, порятував відлюдькуватого сусіда Говарда Боудітча та найнявся до нього на роботу. Саме там хлопець знайшов собі вірного друга - собаку Радар. І це була б звичайнісінька історія, якби не загадковий сарай біля будинку містера Боудітча, зсередини якого час від часу долинають дивні звуки… У який світ потрапить Чарлі через виявлений у сараї портал і проти якого зла йому доведеться боротися? Ідея цієї «казки», як і будь-якої іншої, напрочуд проста й очевидна: будь добрим і відважним, герою, любов здатна подолати все, навіть у найтемніші часи…',
    tags: 'new'
  });
  Item.create({
    id: 8,
    itemType: "book",
    author: 'Девід Мітчелл',
    title: "Тисяча осеней Якоба де Зута",
    image: "https://book-ye.com.ua/upload/resize_cache/iblock/d76/520_860_1/a5d00f01_f94e_11ed_8183_00505684ea69_c475dda2_1bf3_11ee_8187_00505684ea69.jpg",
    publisher: "Жорж",
    year: 2023,
    isbn: '9786178023614',
    pageCount: 588,
    lang: 'українська',
    price: 837,
    reducedPrice: 638,
    isReducedNow: true,
    annotation: '1799 рік. Рукотворний острів Дедзіма в бухті Наґасакі, єдине вікно Японської імперії в західний світ. Сюди з контрабандним Псалтирем у скрині та великими сподіваннями в серці приїжджає голландський писар Якоб де Зут. На Дедзімі, серед хитромудрих торговців і підступних тлумачів, дорогих куртизанок і дешевих повій, він планує провести п’ять років, щоб заробити статок та одружитися з багатою нареченою в Голландії. Однак величний Схід затягує його в химерну гру, де кожен хід — це поворот долі, а на кону — життя. Одна випадкова зустріч і одна необачна обіцянка зрештою змусять Якоба «переписати» власне майбутнє. У романі «Тисяча осеней Якоба де Зута» історичні факти, доповнені авторською уявою, — ідеально змальоване тло, на якому Мітчелл переплітає химерні лінії людських доль.',
    tags: 'new'
  });
  Item.create({
    id: 9,
    itemType: "book",
    author: 'Пилип Білянський',
    title: "Луни",
    image: "https://book-ye.com.ua/upload/iblock/697/5d81bb49_ddee_11ed_8182_00505684ea69_1025eec9_ddef_11ed_8182_00505684ea69.jpg",
    publisher: "Темпора",
    year: 2023,
    isbn: '9786175696040',
    pageCount: 228,
    lang: 'українська',
    price: 230,
    reducedPrice: null,
    isReducedNow: false,
    annotation: 'Прокидатися. Висовувати голову з холодної води, витріщати очі в небо і ляскати ротом. Лякатися. Придумувати собі якийсь ґрунт, землю, основу. Відрощувати ноги, вуха. А опісля — прибиватися до двоногих риб. І скоса поглядати на воду, сумніваючись у правильності своїх рішень. Головний герой — чи то людина, чи то риба. Відбився від косяка, вигадує собі землю, викидається на берег і намагається йти далі, шукаючи мету. Усе в світі говорить з ним. Море, ліс, люди, речі, будинки. А людей навколо нього щодня дедалі менше, вони зникають невідомо куди. Чи це паранормальний феномен? Чи свідомість героя грає з ним у дивну гру?',
    tags: 'new'
  });
  Item.create({
    id: 10,
    itemType: "book",
    author: 'Сара Пірс',
    title: "Ретрит. Книга 2",
    image: "https://book-ye.com.ua/upload/iblock/7ea/c99384fe_f4ad_11ed_8183_00505684ea69_164d1ae0_f4b0_11ed_8183_00505684ea69.jpg",
    publisher: "Артбукс",
    year: 2023,
    isbn: '9786175230435',
    pageCount: 448,
    lang: 'українська',
    price: 667,
    reducedPrice: 449,
    isReducedNow: true,
    annotation: 'Прокидатися. Висовувати голову з холодної води, витріщати очі в небо і ляскати ротом. Лякатися. Придумувати собі якийсь ґрунт, землю, основу. Відрощувати ноги, вуха. А опісля — прибиватися до двоногих риб. І скоса поглядати на воду, сумніваючись у правильності своїх рішень. Головний герой — чи то людина, чи то риба. Відбився від косяка, вигадує собі землю, викидається на берег і намагається йти далі, шукаючи мету. Усе в світі говорить з ним. Море, ліс, люди, речі, будинки. А людей навколо нього щодня дедалі менше, вони зникають невідомо куди. Чи це паранормальний феномен? Чи свідомість героя грає з ним у дивну гру?',
    tags: 'new,top'
  });
  Item.create({
    id: 11,
    itemType: "book",
    author: 'Т.Дж. Клюн',
    title: "Дім у волошковому морі",
    image: "https://book-ye.com.ua/upload/iblock/5f3/2bad8529_d3c1_11ed_8182_00505684ea69_799e0914_d3c2_11ed_8182_00505684ea69.jpg",
    publisher: "Book Chef",
    year: 2023,
    isbn: '9786175481479',
    pageCount: 400,
    lang: 'українська',
    price: 440,
    reducedPrice: 259,
    isReducedNow: true,
    annotation: 'Управління магічної молоді відстежує усіх дітей із надприродними здібностями, намагаючись, утім, їх контролювати, утримуючи в притулках подалі від пересічного люду. Один із таких — найзагадковіших — притулків причаївся на острові Марсіяс серед неозорого океану. Саме сюди командирують Лайнуса Бейкера з інспекцією найвищого рівня секретності. Інспектор натрапляє на дітей в подобі духа лісу, гномиці, віверна, пса-перевертня… Та попри незвичну зовнішність, яка насторожує, ба навіть відлякує звичайних людей, у душах цих створінь зростають і плекаються людяність, чуйність і доброзичливість, яких так бракує у сьогочасному жорстокому й прагматичному світі. Утім це ще не всі дивацтва цього загадкового притулку. Інспектор Лайнус іще має довідатися, що криється за дверима закинутого підвалу та які таємниці приховує директор притулку Артур Парнас, який хвацько зодягається у строкаті костюми та картаті шкарпетки, що постійно визирають із черевиків.',
    tags: 'top'
  });
  Item.create({
    id: 12,
    itemType: "book",
    author: 'Сергій Жадан',
    title: "30 віршів про любов і залізницю",
    image: "https://book-ye.com.ua/upload/resize_cache/iblock/d1a/520_860_1/6709f919_fa0d_11ed_8183_00505684ea69_fdc833b2_fa0e_11ed_8183_00505684ea69.jpg",
    publisher: "Видавництво Старого Лева",
    year: 2023,
    isbn: '9789664481233',
    pageCount: 88,
    lang: 'українська',
    price: 224,
    reducedPrice: 183,
    isReducedNow: true,
    annotation: `З самого дитинства ми сприймаємо залізницю не лише як щось, пов'язане із транспортом, а як велику таємницю, що дозволяє вирушити в мандрівку, здолати відстань, долучитися до великого простору, здобути новий досвід. З мандрами й поїздками нерозривно зв'язані й любовні переживання, розлуки та зустрічі, перестук розбитих сердець чи ніжні й тремкі обійми на перонах. Вздовж залізниці твориться історія країни. У книжці Сергія Жадана читачі знайдуть поезії, що писалися протягом багатьох років, прямо чи опосередковано пов'язані із залізницею. Тут вокзальна площа приходить у сни, люди, схожі на равликів, сплять на вокзалах і несуть на своїх плечах власні домівки, військові вирушають на Схід боронити країну та повертаються до рідних. Під тихий стук коліс та пізні гудки пасажири рахують засніжені пагорби, сонні долини, заміські будівлі, а заклопотані провідники блукають вагонами й розганяють сновидіння.`,
    tags: 'new,top'
  });
  Item.create({
    id: 13,
    itemType: "book",
    author: 'Ребекка Кван',
    title: "Вавилон. Прихована історія",
    image: "https://book-ye.com.ua/upload/resize_cache/iblock/93b/520_860_1/41e221d9_2faf_11ee_8187_00505684ea69_a9d1b3f0_2faf_11ee_8187_00505684ea69.jpg",
    publisher: "Жорж",
    year: 2023,
    isbn: '9786178023805',
    pageCount: 584,
    lang: 'українська',
    price: 638,
    reducedPrice: 489,
    isReducedNow: true,
    annotation: `Найкращий роман за версією премій Nebula і Locus.
    Історичне епічне фентезі про студентські революції, колоніальний спротив та використання мови й перекладу як інструмента домінування імперії.
    
    1828 рік. Робіна Свіфта, осиротілого через спалах холери в Кантоні, забирає в Лондон загадковий професор Ловелл. Там Робін роками навчається латини, давньогрецької та китайської, готуючись одного дня вступити до престижного Королівського інституту перекладу Оксфордського університету, також відомого як Вавилон. Вежа та її студенти — це світовий центр перекладу, і, що важливіше, магії. Сріблярство — мистецтво проявлення значеннєвих втрат у перекладі за допомогою срібних зливків. Саме завдяки сріблярству британці здобули нечувану силу, бо ж таємне ремесло допомагає імперії в колоніальних прагненнях.
    Для Робіна Оксфорд — це утопія, присвячена пошуку знання. Але знання кориться владі, і як китайський хлопчик, що виріс у Британії, він розуміє, що служити Вавилону означає зрадити свою батьківщину...
    
    `,
    tags: 'new,top'
  });
  Item.create({
    id: 14,
    itemType: "book",
    author: 'Стівен Кінг',
    title: "Довга Хода",
    image: "https://book-ye.com.ua/upload/resize_cache/iblock/afd/520_860_1/51cac465_8951_11e6_80c0_000c29ae1566_26828a9d_9e58_11ed_817a_0050568ef5e6.jpg",
    publisher: "Книжковий клуб «Клуб Сімейного Дозвілля»",
    year: 2023,
    isbn: '9786171297975',
    pageCount: 288,
    lang: 'українська',
    price: 446,
    reducedPrice: 366,
    isReducedNow: true,
    annotation: `З самого дитинства ми сприймаємо залізницю не лише як щось, пов'язане із транспортом, а як велику таємницю, що дозволяє вирушити в мандрівку, здолати відстань, долучитися до великого простору, здобути новий досвід. З мандрами й поїздками нерозривно зв'язані й любовні переживання, розлуки та зустрічі, перестук розбитих сердець чи ніжні й тремкі обійми на перонах. Вздовж залізниці твориться історія країни. У книжці Сергія Жадана читачі знайдуть поезії, що писалися протягом багатьох років, прямо чи опосередковано пов'язані із залізницею. Тут вокзальна площа приходить у сни, люди, схожі на равликів, сплять на вокзалах і несуть на своїх плечах власні домівки, військові вирушають на Схід боронити країну та повертаються до рідних. Під тихий стук коліс та пізні гудки пасажири рахують засніжені пагорби, сонні долини, заміські будівлі, а заклопотані провідники блукають вагонами й розганяють сновидіння.`,
    tags: 'new,top'
  });
  //create some orders
  Order.create({
    userId: 1,
    name: "Владислав",
    surname: "Найдін",
    phoneNumber: "+380954279092",
    email: "vlad_naidin@outlook.com",
    city: "Київ",
    address: "Саксаганського 121",
    branch: "",
    comments: "квартира 38",
    delMethod: "4",
    items: "2,10,8,7,7",
    price: 3008,
    status: 0
  });
  Order.create({
    name: "John",
    surname: "Black",
    phoneNumber: "+380954279092",
    email: "aaa@outlook.com",
    city: "Lviv",
    address: "Саксаганського 23",
    branch: "1",
    comments: "",
    delMethod: '1',
    items: "1,8",
    price: 380,
    status: 0
  });
}