/* eslint-disable react/no-unescaped-entities */
/* eslint-disable max-len */
import React from 'react';
import { Container, Row } from 'react-bootstrap';
import { Helmet } from 'react-helmet';
import { useTranslation } from 'react-i18next';

import './index.css';

export default function TermsOfUse() {
  const { t } = useTranslation();

  return (
    <Container>
      <Helmet>
        <title>{t('pages.terms-of-use.title-p')}</title>
      </Helmet>
      <Row className="my-3">
        <h2>{t('pages.terms-of-use.title-1')}</h2>
        <h2>{t('pages.terms-of-use.title-2')}</h2>
      </Row>
      <Row className="unselectable my-3">
        <ol style={{ textAlign: 'justify' }}>
          <li>
            <h3 className="text-center" style={{ fontWeight: 'bold' }}> ЗАГАЛЬНІ ПОЛОЖЕННЯ ТА ПРЕДМЕТ ДОГОВОРУ</h3>
            <ol>
              <li>
                Даний Публічний договір [оферта] (далі за текстом – Договір) є офіційною пропозицією ФОП Родіонов Олександр  Павлович (номер запису в ЄДР 2010350000000275745 від 14.03.2023, далі за текстом – Продавець) укласти договір купівлі-продажу товарів дистанційним способом, тобто через
                {' '}
                <a href="https://alineabooks.com">Інтернет-магазин</a>
                {' '}
                <i> https://alineabooks.com </i>
                ( далі за текстом Інтернет-магазин або Сайт).
              </li>
              <li>
                Цей Договір відповідно до ст. ст. 633, 641 та Голови 54 Цивільного кодексу України є публічним договором (офертою), адресованим невизначеному колу осіб, які бажають придбати товари в
                {' '}
                <a href="https://alineabooks.com">Інтернет-магазині </a>
                {' '}
                та його умови однакові для всіх Покупців незалежно від їх статусу (фізична особа, юридична особа, фізична особа-підприємець) без надання переваги одному Покупцю перед іншим.
                {' '}
              </li>
              <li>За умовами цього Договору Продавець зобов’язується передати у власність Покупця Товар, а Покупець зобов’язується оплатити і прийняти Товар за ціною, в строки та на умовах, визначених положеннями даного Договору.</li>
              <li>Цей Договір регулює відносини купівлі-продажу товарів в Інтернет-магазині, в тому числі, але не виключно:</li>
              <ul>
                <li>добровільний вибір Покупцем товарів в Інтернет-магазині;</li>
                <li>самостійне оформлення Покупцем замовлення в Інтернет-магазині;</li>
                <li>порядок оплати Покупцем замовлення, оформленого в Інтернет-магазині;</li>
                <li>порядок обробки та доставки замовлення Покупцеві.</li>
              </ul>
              <li>
                Датою укладення Договору (акцептом оферти) та моментом повного й беззаперечного прийняття Покупцем умов Договору вважається дата заповнення Покупцем форми замовлення, розташованої на сайті Інтернет-магазину/в Кабінеті Користувача, за умови отримання Покупцем від Продавця підтвердження замовлення в електронному вигляді.
                <ol>
                  <li>Факт доставки замовленого Покупцем Товару відповідно до оформленого на Сайті Замовлення Покупця, є повним виконанням Продавцем взятих на себе зобов’язань згідно Договору.</li>
                  <li>Факт оплати Покупцем замовлення на умовах цього Договору, у строки та за цінами, вказаними в Інтернет-магазині Продавця є фактом виконанням Покупцем взятих на себе зобов’язань згідно умов цього Договору.</li>
                </ol>
              </li>
              <li>
                Оскільки цей Договір є публічною офертою та окрім відносин купівлі-продажу, регулює відносини права інтелектуальної власності, використання інформації та баз даних, що зазначаються на
                {' '}
                <a href="https://alineabooks.com"> веб-сайті </a>
                {' '}
                та надаються Інтернет-магазину Користувачами Сайту, то, отримуючи доступ до матеріалів Інтернет-магазину Користувачі автоматично погоджуються з умовами цього Договору стосовно згоди на обробку персональних даних, застереження про конфіденційність, виняткових прав та інших умов Договору, що стосуються Користувача.
              </li>
              <li>
                Продавець/ Власник
                {' '}
                <a href="https://alineabooks.com">сайту </a>
                {' '}
                або уповноважені ним особи мають право в будь-який час в одностороньому порядку змінювати умови цього Договору. Новий або змінений Договір стає дійсними після розміщення його на сайті Інтернет-магазину. У разі незгоди Покупця (Користувача) з внесеними змінами він зобов'язаний відмовитися від користування  сайтом, припинити використання матеріалів і сервісів сайту.
              </li>
              <li>
                У цьому Договорі наведені нижче терміни мають таке значення:
                <ul>
                  <li>Публічна оферта - публічна пропозиція Продавця, адресована невизначеному колу осіб, укласти з Продавцем договір купівлі-продажу товару дистанційним способом  на умовах, що містяться в цьому Договорі.</li>
                  <li>Товар – опубліковані на сторінках Інтернет-магазину книги, журнали, різноманітні друковані видання та інші товари, що можуть бути представлені на Сайті у формі зображення, назви, опису, ціни таких товарів, приміток тощо.</li>
                  <li>

                    {' '}
                    <a href="https://alineabooks.com">Інтернет-магазин – веб-сайт </a>
                    , що створений з метою реалізації Товарів, представлених на його сторінках, через мережу Інтернет, шляхом вчинення електронного правочину.
                  </li>
                  <li>Користувач – будь-яка особа, яка коли-небудь здійснювала доступ до Сайту. Користувачем вважається особа до моменту здійснення акцепту цього Договору. Після оформлення замовлення на Сайті, Користувач переходить в статус Покупця.</li>
                  <li>Кабінет користувача – елемент інтерфейсу Сайту, який робить для Користувача більш комфортним та персоналізованим доступ до Інтернет-магазину. Через Кабінет Користувача Покупці можуть оформлювати замовлення, бачити історію своїх покупок, зберігати адреси доставки тощо. </li>
                  <li>Продавець – юридична особа або фізична особа-підприємець, що реалізує товари, представлені на сайті Інтернет-магазину.</li>
                  <li>Покупець – фізична особа, яка досягла вісімнадцятирічного віку, має повну цивільну дієздатність, є користувачем Сайту та отримує інформацію від Інтернет-магазину, що оформила замовлення та купує Товари, які представлені на сайті Інтернет-магазину, для цілей не пов’язаних із здійсненням підприємницької діяльності, або юридична особа/фізична особа-підприємець.</li>
                  <li>Замовлення – оформлена та розміщена заявка Покупця, адресована Інтернет-магазину, на придбання і доставку від його імені і за його дорученням Товарів.</li>
                </ul>
              </li>
            </ol>
          </li>
          <br />
          <li>
            <h3 className="text-center" style={{ fontWeight: 'bold' }}>ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ ТА КАБІНЕТ КОРИСТУВАЧА</h3>
            <ol>
              <li>Користувач (Покупець) може переглядати вміст Сайту, оформлювати замовлення, а також користуватися іншими його сервісами як безпосередньо на сайті Інтернет-магазину, так і через Кабінет Користувача. </li>
              <li>
                Для формування замовлень на Сайті Користувач (Покупець) може пройти процедуру ідентифікації шляхом реєстрації в Кабінеті Користувача з зазначенням всіх необхідних даних, визначених у відповідній анкеті або здійснити покупку безпосередньо на Сайті без реєстрації в Кабінеті Користувача шляхом додавання необхідного товару у «Кошик, заповнення всіх необхідних даних для доставки Замовлення та натискання кнопки «Оформити замовлення»/ «Купити».
                <ol>
                  <li>Під час оформлення замовлення та/або реєстрації на Сайті Користувач (Покупець) зобов'язується надати достовірну та точну інформацію про себе і свої контактні дані для виконання Продавцем своїх зобов'язань перед Покупцем і доставки йому визначеного в замовленні Товару.</li>
                  <li>У процесі реєстрації на Сайті Користувач (Покупець) вказує логін (його e-mail) і пароль, за безпеку яких він несе відповідальність. Користувач (Покупець) зобов'язується не повідомляти третім особам логін і пароль, вказані під час реєстрації, зберігати ці дані в недоступному для сторонніх осіб місці. За всі дії, що здійснені від його імені, тобто з використанням його логіна та пароля, відповідальність несе винятково Покупець.</li>
                </ol>
              </li>
              <li>Покупець має право оформити замовлення на будь-який Товар, представлений на Сайті Інтернет-магазину в будь-якій кількості, за умови його наявності.</li>
              <li>Користувач (Покупець) погоджується з тим, що ціна на товар, відкладений їм до «кошика» в Кабінеті Користувача або безпосередньо на сайті Інтернет-магазину, його асортимент і кількість, будуть актуальними лише на момент формування «кошика» і можуть змінюватися, якщо покупка не була остаточно оформлена шляхом натискання кнопки «оформити замовлення»/«купити».</li>
              <li>
                У разі відсутності Товару, визначеного у замовленні Покупця, на складі Продавця, відповідальний менеджер  зобов’язаний зв’язатись з Покупцем та повідомити про відсутність Товару з можливістю замінити Товар на інший або узгодити нові терміни очікування поставки обраного Товару.
              </li>
              <li>
                У разі відсутності Товару, визначеного у замовленні, Покупець має право вимагати замінити його іншим Товаром аналогічної вартості та кількості / відмовитися від Товару, визначеного в замовленні/ погодити нові терміни поставки Товару/ анулювати замовлення.
                <ol>
                  <li>У разі якщо Покупець здійснив попередню оплату і бажає замінити Товар на Товар більшої вартості та/або кількості, Покупець зобов’язаний доплатити різницю, що виникає у вартості ціни таких Товарів. </li>
                  <li>У разі якщо Покупець здійснив попередню оплату і бажає замінити Товар на Товар меншої вартості та/або кількості, Продавець зобов’язаний повернути Покупцю різницю, що виникає у вартості ціни таких Товарів.</li>
                  <li>У разі якщо Покупець сплатив 100% попередньої вартості за Товар та  відмовився від замовлення на підставах, визначених у п.2.6. Договору, Продавець зобов’язаний повернути грошову суму Покупцю. </li>
                </ol>

              </li>
              <li>Продавець (Відповідальна особа Продавця) веде комунікацію з Покупцями в телефонному режимі та/або через відповідні месенджери та/або шляхом листування електронною поштою.</li>
              <li>Покупець зобов’язується надати актуальну, таку, що відповідає дійсності, повну і точну інформацію про себе, необхідну для оформлення замовлення та здійснення Продавцем доставки Товару Покупцеві. Інтернет-магазин не несе відповідальності за точність та правильність інформації, наданої Покупцем при оформленні Замовлення та/або зазначеної в Кабінеті Користувача. </li>
              <li>Продавець має право відмовити Покупцеві у користуванні послугами Інтернет-магазину, якщо у останнього будуть підстави вважати, що Покупець вказав недостовірні дані, а так само за умови несумлінного поводження (наприклад, порушення умов цього договору, або ін).</li>
            </ol>
          </li>
          <br />

          <li>
            <h3 className="text-center" style={{ fontWeight: 'bold' }}> ПОРЯДОК ОПЛАТИ ЗАМОВЛЕННЯ</h3>
            <ol>
              <li>Оплата замовлення здійснюється у національній валюті України гривні шляхом перерахування грошових коштів на банківський рахунок Продавця через сервери LiqРay/ інтернет-банкінг Приват24/ NovaPay та інші. Датою оплати вважається дата зарахування грошових коштів на банківський рахунок Продавця.</li>
              <li>Покупець при оформленні Замовлення має право обрати форму здійснення оплати: здійснити попередню оплату у розмірі 100% вартості Товару, визначеного в замовленні або обрати післяплату у формі післяплати через відповідну службу доставки (транспортно-логістичну компанію-перевізника або оператора поштового зв’язку). У разі обрання попередньої оплати та ненадходження грошових коштів на банківський рахунок Продавця, Продавець залишає за собою право анулювати замовлення.</li>
              <li>
                Покупець також може розрахуватись за Товар шляхом застосування відповідного Промо-коду або Сертифікату. Покупець погоджується з тим, що Промо-коди або Сертифікати застосовуються лише один раз.
                <ol>
                  <li>У разі якщо сума замовлення перевищує суму, що є номіналом відповідного Сертифікату або промо-коду, Покупець зобовязаний доплатити таку різницю. </li>
                  <li>У разі якщо сума замовлення менше суми, що є номіналом відповідного Сертифікату або промо-коду, така різниця Продавцем не компенсується.</li>
                </ol>
              </li>
              <li> Вартість послуг з доставки Товару не входить в ціну Товару та сплачується Покупцем окремо під час отримання Покупцем Товару згідно тарифів компанії-перевізника.</li>
            </ol>
          </li>
          <br />

          <li>
            <h3 className="text-center" style={{ fontWeight: 'bold' }}> УМОВИ ДОСТАВКИ ЗАМОВЛЕННЯ</h3>
            <ol>
              <li>Доставка Товарів, придбаних в Інтернет-магазині, здійснюється через транспортно-логістичні компанії та операторів поштового зв’язку згідно діючих тарифів відповідних транспортно-логістичних компаній та операторів поштового зв’язку (далі – служби доставки). </li>
              <li>Доставка Замовлень по території України може здійснюватись через служби доставки таких операторів як: Укрпошта, Нова Пошта, Delivery, Meest, FedEx тощо. Вартість доставки кожного Замовлення розраховується самостійно відповідною службою доставки, враховуючи вагу Замовлення, регіон і спосіб доставки за тарифами</li>
              <li>Разом із Замовленням Покупцеві надаються документи на Товар, визначені чинним законодавством України, зокрема: товарний чек та видаткова накладна на товар.</li>
            </ol>
          </li>
          <br />

          <li>
            <h3 className="text-center" style={{ fontWeight: 'bold' }}> ПОРЯДОК ПОВЕРНЕННЯ ТА ОБМІНУ ТОВАРУ</h3>
            <ol>
              <li>Повернення товару в Інтернет-магазин проводиться відповідно до норм чинного законодавства України.</li>
              <li>Повернення товару в Інтернет-магазин проводиться за рахунок Покупця.</li>
              <li>Обмін або повернення товару можливе протягом 14 днів з моменту покупки Товару, без врахування дня покупки. Обмін або повернення Товару проводиться, якщо він не використовувався ( і якщо збережено його  товарний вид, споживчі властивості, пломби, ярлики та наявний оригінал розрахункового документа, виданого Продавцем разом з товаром.</li>
              <li>При поверненні Покупцем Товару належної якості, Інтернет-магазин повертає йому сплачену за Товар грошову суму за фактом повернення Товару за вирахуванням компенсації витрат Інтернет-магазину пов’язаних з доставкою товару Покупцеві.</li>
              <li>
                Відповідно до Постанови Кабінету Міністрів України від 19 березня 1994 р. № 172 «Про реалізацію окремих положень Закону України «Про захист прав споживачів» (з усіма наступними змінами та доповненнями), розміщеному на офіційному сайті Верховної Ради України за
                {' '}
                <a href="https://zakon.rada.gov.ua/laws/show/172-94-%D0%BF#Text ">посиланням</a>
                {' '}
                , друковані видання належної якості не підлягають обміну, поверненню.
              </li>
              <li>
                Покупець погоджується з тим, що придбаний ним Товар не підлягає обміну та поверненню в наступних випадках:
                <ol>
                  <li>Із моменту покупки Товару пройшло більше 14 календарних днів;</li>
                  <li>Із моменту придбання Товару не минуло 14 календарних днів, але товар був у вжитку, порушена цілісність упаковки і / або комплектність, відсутні бирки / цінники і т.д.;</li>
                  <li>Товар належить до переліку товарів, які поверненню та обміну не підлягають, відповідно до Постанови Кабінету Міністрів України №172 від 19 березня 1994 року (посилання на яку міститься в п.5.5. Договору);</li>
                  <li>Покупець відмовляється надати фото- чи відеоматеріали бракованого і / або несправного, на його погляд, товару;</li>
                  <li>Інші визначені Договором та чинним законодавством України випадки.</li>
                </ol>
              </li>
              <li>
                Покупець погоджується з тим, що Промо-коди/Сертифікати не підлягають обміну на зазначений в них грошовий еквівалент та можуть бути застосовані лише в якості оплати сформованого замовлення лише один раз.
                <ol>
                  <li>Покупець погоджується з тим, що при поверненні товару, за який було частково або повністю сплачено за допомогою коду сертифікату, грошовий еквівалент номіналу сертифікату не повертається, код сертифіката автоматично відновлюється і вважається не використаним.</li>
                </ol>
              </li>
              <li>Порушення вищезазначених пунктів розділу 5 Договору залишає за Продавцем право відмовити Покупцеві в обміні або поверненні товару.</li>
              <li>У випадку виявлення поліграфічного браку книжкової продукції Продавець, за бажанням Покупця, здійснює обмін Товару на Товар належної якості, або здійснює повернення коштів у розмірі вартості повернутої продукції. Поліграфічний брак – це брак, отриманий внаслідок недотримання технології виробництва, що призводить до перекручування або втрати інформації: розмазування фарби, непродруковування фарби, нечіткий друк, склеєні сторінки, нерівне обрізання, перевернуті аркуші, відсутність аркушів, або їх повторення, невідповідність назви книжки на обкладинці її змісту, тощо).</li>
            </ol>
          </li>
          <br />

          <li>
            <h3 className="text-center" style={{ fontWeight: 'bold' }}> ПРАВА ТА ОБОВʼЯЗКИ СТОРІН</h3>
            <ol>
              <li>
                Продавець має право:
                <ul>
                  <li>В односторонньому порядку припинити постачання Товарів за цим Договором у разі порушення Покупцем його умов.</li>
                  <li>Змінювати умови цього Договору та ціни на Товари в односторонньому порядку, шляхом розміщення актуальної ціни на сайті Інтернет-магазину. Всі зміни набувають чинності з моменту їх публікації на сайті.</li>
                  <li>Вимагати від Покупця виконання умов цього Договору.</li>
                </ul>
              </li>
              <li>
                Продавець зобов’язаний:
                <ul>
                  <li>Поставити Покупцю Товар згідно із Замовленням, у випадку виконання Покупцем умов цього Договору.</li>
                  <li>Перевірити якісні та кількісні характеристики Товару під час його пакування.</li>
                </ul>
              </li>
              <li>
                Покупець зобов’язаний:
                <ul>
                  <li>Ознайомитися з інформацією про Товар, яка розміщена на сайті Інтернет-магазину</li>
                  <li>Ознайомитися та прийняти умови цього Договору або відмовитися від оформлення Замовлення, якщо умови Договору є неприйнятними.</li>
                  <li>Оплатити вартість Замовлення у визначеному Договором порядку та строки.</li>
                  <li>Прийняти обраний в Замовленні Товар.</li>
                  <li>При отриманні Товару впевнитися у його комплектності шляхом огляду вмісту упаковки. У випадку виявлення нестачі Товару або його пошкоджень – зафіксувати їх  у відповідному дефектному акті, який разом із Покупцем має підписати представник компанії перевізника.</li>
                </ul>
              </li>
              <li>
                Покупець має право:
                <ul>
                  <li>Здійснити оформлення Замовлення в Інтернет-магазині.</li>
                  <li>Вимагати від Продавця виконання умов цього Договору.</li>
                </ul>
              </li>
            </ol>
          </li>
          <br />

          <li>
            <h3 className="text-center" style={{ fontWeight: 'bold' }}> ВІДПОВІДАЛЬНІСТЬ СТОРІН</h3>
            <ol>
              <li>Сторони несуть відповідальність за невиконання або неналежне виконання умов цього Договору в порядку, передбаченому цим Договором та чинним законодавством України.</li>
              <li>
                Продавець/Власник сайту не несе відповідальності за:
                <ul>
                  <li>змінений виробником зовнішній вигляд Товару;</li>
                  <li>за незначну невідповідність кольорової гами товару, що може відрізнятися від оригіналу товару виключно через різну кольорову передачу зображення на моніторах персональних комп’ютерів Покупця;</li>
                  <li>за зміст і достовірність інформації, наданої Покупцем при оформленні Замовлення;</li>
                  <li>за неналежне, несвоєчасне виконання Замовлень і своїх зобов’язань у випадку надання Покупцем недостовірної або помилкової інформації;</li>
                  <li>за затримку при обробці замовлення та доставки товару, які відбуваються з причин, що знаходяться поза сферою контролю Продавця;</li>
                  <li>за шкоду, заподіяну Покупцеві або третім особам внаслідок неналежного монтажу, використання, зберігання Товару придбаного у Продавця;</li>
                  <li>за протиправні, незаконні дії, здійснені Покупцем за допомогою даного доступу до мережі Інтернет;</li>
                  <li>за передачу Покупцем своїх мережевих ідентифікаторів – IP, MAC-адреси, логіна і пароля третім особам.</li>
                  <li>за втрату Користувачем можливості доступу до свого облікового запису в Кабінеті Користувача;</li>
                  <li>за будь-які помилки, друкарські огріхи та неточності, які можуть бути виявлені в матеріалах, що містяться на цьому веб-сайті. Продавець та Власник сайту докладає всіх необхідних зусиль, щоб забезпечити точність і достовірність на сайті Інтернет-магазину інформації.</li>
                  <li>за висловлювання і думки Користувачів/Покупців Інтернет-магазину, залишених в якості коментарів або оглядів;</li>
                  <li>за шкоду, збитки або витрати (реальні або можливі), що виникли в зв'язку з цим веб-сайтом, його використанням або неможливістю використання; </li>
                  <li>затримки або збої в процесі здійснення операції, що виникли внаслідок непереборної сили, а також будь-якого збою у телекомунікаційних, комп'ютерних, електричних та інших суміжних системах;</li>
                  <li>дії систем переказів, банків, платіжних систем і за затримки, пов'язані з їх роботою;</li>
                  <li>належне функціонування Сайту, якщо Користувач/Покупець не має необхідних технічних засобів для його використання, а також не несе жодних зобов'язань щодо забезпечення користувачів такими засобами.</li>
                </ul>
              </li>
              <li>У разі настання обставин непереборної сили, сторони звільняються від виконання умов цього Договору. Під обставинами непереборної сили для цілей цього договору розуміються події, що мають надзвичайний, непередбачений характер, які виключають або об’єктивно заважають виконанню цього договору, настання яких Сторони не могли передбачити і запобігти розумними способами.</li>
              <li>Всі спори та розбіжності, що виникають між Сторонами цього Договору повинні вирішуватись шляхом переговорів. У випадку недосягнення згоди та неможливості врегулювання спору в досудовому порядку, Сторони можуть звернутись до судових органів з метою врегулювання спірного питання відповідно до норм чинного законодавства України.</li>
            </ol>

          </li>
          <br />

          <li>
            <h3 className="text-center" style={{ fontWeight: 'bold' }}> ЗАСТЕРЕЖЕННЯ ПРО КОНФІДЕНЦІЙНІСТЬ ТА ЗГОДА НА ОБРОБКУ ПЕРСОНАЛЬНИХ ДАНИХ</h3>
            <ol>
              <li>Інформація , надана Користувачем/Покупцем є конфіденційною. Продавець/ Власник сайту використовує інформацію про Користувача /Покупця з метою виконання Замовлень Покупця, якщо інших цілей не вказано в цьому Договорі. Надаючи свої персональні дані на сайті Інтернет-магазину при реєстрації або оформленні Замовлення, Користувач/Покупець надає Продавцеві/Власникові сайту свою добровільну згоду на обробку, використання (у тому числі і передачу) своїх персональних даних, а також вчинення інших дій, передбачених Законом України «Про захист персональних даних», без обмеження терміну дії такої згоди.</li>
              <li>
                Заповнюючи реєстраційні дані на
                {' '}
                <a href="https://alineabooks.com">сайті </a>
                {' '}
                під час оформлення Замовлення або під час реєстрації в Кабінеті Користувача Покупець/Користувач добровільно дає згоду на збір і обробку своїх персональних даних Продавцем/Власником Сайту з метою використання наданої інформації для обробки Замовлень на придбання Товарів, отримання інформації про замовлення, відправки телекомунікаційними засобами зв'язку(електронною поштою, мобільним зв'язком) рекламних та спеціальних пропозицій, інформації про акції, розіграші або будь-яку іншу інформацію про діяльність
                {' '}
                <a href="https://alineabooks.com">сайту </a>
                {' '}
                та в інших комерційних цілях.
              </li>
              <li>Для цілей, передбачених цим розділом Договору, Продавець/Власник Сайту має право надсилати листи, повідомлення та матеріали на поштову адресу, e-mail Покупця/Користувача, а також надсилати sms-повідомлення, здійснювати дзвінки на вказаний в анкеті номер, якщо це необхідно для виконання замовлення Покупця (Користувача). Продавець/Власник Сайту має право здійснювати запис телефонних дзвінків із Покупцем/Користувачем з метою поліпшення якості обслуговування клієнтів, на що Покупець/Користувач дає свою беззастережну згоду.</li>
              <li>
                Покупець/Користувач дає згоду на використання Власником Сайту технології cookie. Файли cookie не містять особистої інформації та не можуть жодним чином зчитувати інформацію жорсткого диска Покупця/Користувача. Файли cookie використовують для того, щоб підвищувати якість послуг, що надаються, зокрема для швидкої ідентифікації Покупця/ Користувача, збереження налаштувань Покупця/Користувача, його персональних уподобань, відстеження стану сесії доступу Покупця/Користувача і характерних для нього тенденцій. Власник Сайту також використовує файли cookie в рекламних цілях, зокрема щоб керувати оголошеннями на сайтах у мережі Інтернет. Після вимкнення технології cookie Покупцем/ Користувачем, Власник Сайту не гарантує повної працездатності
                {' '}
                <a href="https://alineabooks.com">веб-сайту </a>
                {' '}
                або деяких його сервісів.
              </li>
              <li>Покупець дає право Продавцю/Власнику Сайту здійснювати обробку його персональних даних, зокрема поміщати персональні дані в бази даних Продавця/Власника Сайту (без додаткового повідомлення про це), здійснювати довічне зберігання даних, їх накопичення, оновлення, зміну (за потреби). Продавець/Власник Сайту зобов'язується забезпечити захист даних від несанкціонованого доступу третіх осіб, не поширювати і не передавати дані будь-якій третій стороні (крім передачі даних співробітникам, комерційним партнерам, особам, уповноваженим Продавцем/Власником Сайту на здійснення безпосередньої обробки даних для зазначених цілей, а також на законний запит компетентного державного органу).</li>
              <li>У разі небажання отримувати розсилання про рекламні акції, нові продукти тощо Покупець /Користувач має право відмовитися від розсилки, шляхом надсилання листа Продавцеві та / або зазначення відповідної відмітки в особистому Кабінеті Користувача.</li>
              <li>
                Продавець/Власник Сайту не несе відповідальності за зміст і достовірність інформації, наданої Покупцем/Користувачем під час реєстрації на
                {' '}
                <a href="https://alineabooks.com">веб-сайті </a>
                . Покупець (Користувач) несе відповідальність за достовірність зазначеної під час реєстрації на веб-сайті та оформлення Замовлення інформації, погоджується на всі ризики, пов'язані з недостовірністю наданої інформації.
              </li>
            </ol>

          </li>
          <br />

          <li>
            <h3 className="text-center" style={{ fontWeight: 'bold' }}> ВИНЯТКОВІ ПРАВА ТА ІНШІ УМОВИ ДОГОВОРУ</h3>
            <ol>
              <li>
                Всі об'єкти, доступні з допомогою сервісів
                {' '}
                <a href="https://alineabooks.com">Сайту </a>
                , зокрема елементи дизайну, текст, графічні зображення, ілюстрації, відео, програми для ЕОМ, бази даних, музика, звуки та інші об'єкти (далі — зміст сервісів), а також будь-який контент, розміщений на
                {' '}
                <a href="https://alineabooks.com">веб-сайті </a>
                {' '}
                є об'єктами виняткових прав Власника Сайту та інших правовласників.
              </li>
              <li>
                Використання контенту, а також будь-яких інших елементів сервісів можливо тільки в рамках функціоналу, пропонованого тим чи іншим сервісом. Жодні елементи змісту сервісів
                {' '}
                <a href="https://alineabooks.com"> Сайту </a>
                ,а також будь-який контент, розміщений на сервісах
                {' '}
                <a href="https://alineabooks.com"> Сайту </a>
                {' '}
                не можуть бути використані іншим чином без отримання попереднього дозволу / згоди правовласника. Під використанням розуміється відтворення, копіювання, переробка, поширення в будь-якому форматі, відображення у розіграші тощо за винятком  випадків, передбачених чинним законодавством України. Використання Користувачем елементів змісту сервісів, а також будь-якого контенту для особистого некомерційного користування допускається за умови збереження всіх знаків охорони авторського права, суміжних прав, товарних знаків, інших повідомлень про авторство, збереження імені (або псевдоніма) автора / найменування правовласника в незмінному вигляді, збереженні відповідного об'єкта в незмінному вигляді.
              </li>
              <li>Продавець/Власник Сайту лишає за собою право коригувати (в тому числі змінювати або видаляти) інформацію, розміщену на Сайті.</li>
              <li>Продавець/Власник Сайту лишає за собою право робити технічні і юридичні заходи для припинення доступу до Інтернет-магазину Користувачів/Покупців, що створюють проблеми у використанні Інтернет-магазину іншими Користувачами/Покупцями у разі будь-яких недобросовісних зловживань з їх боку при замовленні товару, що не мають на меті його придбання, а також Користувачів/Покупців, які порушують умови цього Договору. У разі застосування санкцій, передбачених цим пунктом, блокування Користувача/Покупця відбувається на розсуд Продавця/Власника Сайту без жодного повідомлення таких Користувачів/Покупців. </li>
              <li>Покупець, формуючи Замовлення на Сайті, погоджується з цією публічною офертою загалом і без застережень. </li>
              <li>Покупець погоджується з тим, що всі умови цього Договору йому зрозумілі та він приймає їх повністю і беззаперечно. </li>
              <li>Комунікація з Продавцем щодо усіх питань та пропозицій здійснюється за допомогою контактів, вказаних на сайті Інтернет-магазину. </li>
              <li>Даний Договір складено українською та англійською мовами. У разі виникнення розбіжностей та неточностей щодо трактування пунктів Договору, пріорітет та перевагу має варіант Договору, викладений на Сайті українською. </li>
            </ol>

          </li>
        </ol>
      </Row>

    </Container>
  );
}
